app/controllers/participations_controller.rb

SELECT "players".* FROM "players"
---
  def new
    @participation=Participation.new
    @registeredplayers=Player.all

INSERT INTO "games" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2021-01-09"], ["created_at", "2021-01-09 16:58:56.235676"], ["updated_at", "2021-01-09 16:58:56.235676"]]
SELECT "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "participations" ("game_id", "player_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["game_id", 4], ["player_id", 1], ["created_at", "2021-01-09 16:58:56.405310"], ["updated_at", "2021-01-09 16:58:56.405310"]]
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create

    # Create a new game
    Game.create(date:Date.today)

    # Retrieve the latest game created
    latest_game=Game.last

    # Create a participation for each of the selected players
    params["participation"]["player"].each do |warrior|

      Participation.create(
        game:latest_game,
        player:Player.find(warrior.to_i)
      )