app/controllers/players_controller.rb

INSERT INTO "players" ("forename", "surname", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["forename", "Clara"], ["surname", "Maquet"], ["created_at", "2021-01-09 13:22:06.593748"], ["updated_at", "2021-01-09 13:22:06.593748"]]
---
  def create
    Player.create(player_params)